Dhurzo/LibreRoaster/sdkconfig.defaults
# ESP32 NodeMCU Configuration
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_TARGET="esp32"

# WiFi Configuration
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=y
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_RX_BA_WIN=6
CONFIG_ESP32_WIFI_NVS_ENABLED=y

# TCP/IP Configuration
CONFIG_LWIP_TCP_KEEPALIVE=y
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCP_WRITEV_DELAY=10

# HTTP Server Configuration
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Logging Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3
CONFIG_LOG_TIMESTAMP_LEVEL_RT_DATA=4

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# Memory Configuration
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32_TRAX_TWOBANKS=y
CONFIG_ESP32_TRACEMEM_RESERVE_DRAM=0x0

# OTA Configuration
CONFIG_OTA_ALLOW_HTTP=y
CONFIG_OTA_ALLOW_BUILTIN=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Performance Configuration
CONFIG_ESP32_PANIC_PRINT_RESTART=y
CONFIG_ESP32_RTCDATA_IN_FAST_MEM=y
CONFIG_ESP32_IRAM_AS_8BIT_STORE=y